1c-configuration-manager/src/DataProcessors/ФормированиеЗадачНаРучнуюОбработку/ФормированиеЗадачНаРучнуюОбработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеЗадачНаРучнуюОбработку</name>
</mdclass:DataProcessor>

1c-configuration-manager/src/InformationRegisters/СравнениеКонфигураций/СравнениеКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СравнениеКонфигураций</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипИзменений</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПредыдущейФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтОкончанияФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВероятностьУспеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПеред</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПосле</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МодульБазовойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>МодульИзмененнойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.ТипыПроблем</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработки</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/InformationRegisters/ОбработанныеОбъектыКонфигурации/ОбработанныеОбъектыКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбработанныеОбъектыКонфигурации</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработки</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритеты</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.ОбъектыКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвойствоОбъектаКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/Enums/СтатусыОбработки/СтатусыОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработки</name>
  <enumValues>
    <name>ТребуетсяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Частично</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/Enums/Приоритеты/Приоритеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Приоритеты</name>
  <enumValues>
    <name>Блокирующий</name>
  </enumValues>
  <enumValues>
    <name>Критический</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>ВПоследнююОчередь</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/Enums/ТипыИзменений/ТипыИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзменений</name>
  <enumValues>
    <name>Совпадение</name>
  </enumValues>
  <enumValues>
    <name>Вставка</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>Замена</name>
  </enumValues>
  <enumValues>
    <name>Неизвестно</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/Enums/ТипыПроблем/ТипыПроблем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПроблем</name>
  <enumValues>
    <name>Порядок</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Неопределено</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/DataProcessors/ФормированиеЗадачНаРучнуюОбработку/Forms/ФормаСоздатьЗадачиНаОбработкуПроблемы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сценарий = Параметры.Сценарий;
	
	Дата = ТекущаяДата();
	
	// Сформируем запрос с данными    
	СформироватьТаблицуПроблем();
	
КонецПроцедуры   

&НаСервере
Процедура СформироватьТаблицуПроблем()
	
	МассивПроблем = ПолучитьСписокПроблем(Сценарий);
	
	ТаблицаПланируемыхЗадач.Очистить();
	
	Для Каждого стр из МассивПроблем Цикл
		стр_н = ТаблицаПланируемыхЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(стр_н,стр);
		стр_н.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОбработки.ТребуетсяОбработка");
		стр_н.Приоритет = ПредопределенноеЗначение("Перечисление.Приоритеты.Основной");
		Если ЗначениеЗаполнено(Дата) Тогда
			стр_н.Дата = Дата;
		Иначе
			стр_н.Дата = ТекущаяДата();
		КонецЕсли;
		Если ЗначениеЗаполнено(Ответственный) Тогда
			стр_н.Ответственный = Ответственный;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПроблем(Сценарий)
	
	МассивПроблем = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СравнениеКонфигураций.Сценарий КАК Сценарий,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации.Конфигурация КАК Конфигурация,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации КАК СвойствоОбъектаКонфигурации
	|ИЗ
	|	РегистрСведений.СравнениеКонфигураций КАК СравнениеКонфигураций
	|ГДЕ
	|	СравнениеКонфигураций.Сценарий = &Сценарий
	|	И СравнениеКонфигураций.ТипИзменений В (ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Вставка), ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Удаление), ЗНАЧЕНИЕ(Перечисление.ТипыИзменений.Замена))
	|	И СравнениеКонфигураций.ТипПроблемы В (ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Ошибка), ЗНАЧЕНИЕ(Перечисление.ТипыПроблем.Предупреждение))
	|
	|СГРУППИРОВАТЬ ПО
	|	СравнениеКонфигураций.МодульБазовойКонфигурации,
	|	СравнениеКонфигураций.Сценарий,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации,
	|	СравнениеКонфигураций.МодульБазовойКонфигурации.ОбъектКонфигурации.Конфигурация";
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураПроблемы = Новый Структура("Сценарий,Конфигурация,ОбъектКонфигурации,СвойствоОбъектаКонфигурации");
		ЗаполнитьЗначенияСвойств(СтруктураПроблемы,Выборка);
		МассивПроблем.Добавить(СтруктураПроблемы);
	КонецЦикла;
	
	Возврат МассивПроблем;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаборЗадач(Команда)
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сообщить("Укажите сценарий сначала!");
		Возврат;
	КонецЕсли;
	СоздатьНаборЗадачСервер();
КонецПроцедуры     

&НаСервере
Процедура СоздатьНаборЗадачСервер()   
	
	Для каждого стр из ТаблицаПланируемыхЗадач Цикл
		
		МенеджерЗаписи = РегистрыСведений.ОбработанныеОбъектыКонфигурации.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,стр);
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТаблицу(Команда)
	СформироватьТаблицуПроблем();
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьОтветственного(Команда)
	Для каждого стр из Элементы.ТаблицаПланируемыхЗадач.ВыделенныеСтроки Цикл
		строка_пз = ТаблицаПланируемыхЗадач.Получить(стр);
		Если НЕ строка_пз=Неопределено Тогда
			строка_пз.Ответственный = Ответственный;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
